{
  "page_title": "Papierkorb (Neu in 2026)",
  "source_url": "https://help.autodesk.com/view/VAULT/2026/DEU/?guid=GUID-9F3302FA-488B-4021-ADDE-DF0AC877298600",
  "slides": [
    {
      "title": "Overview",
      "bullets": [
        "Neu in Vault Neue Funktionen in Vault 2026 2026: Aktualisierungen und Verbesserungen Verbesserte Verwaltungsfunktionen Papierkorb Verbesserungen bei der Archivierung Verbesserungen am Job-Prozessor Allgemeine Verbesserungen 2026.1: Updates und Verbesserungen Neue Funktionen in früheren Versionen",
        "Neue Funktionen in Vault 2026 2026: Aktualisierungen und Verbesserungen Verbesserte Verwaltungsfunktionen Papierkorb Verbesserungen bei der Archivierung Verbesserungen am Job-Prozessor Allgemeine Verbesserungen 2026.1: Updates und Verbesserungen",
        "2026: Aktualisierungen und Verbesserungen Verbesserte Verwaltungsfunktionen Papierkorb Verbesserungen bei der Archivierung Verbesserungen am Job-Prozessor Allgemeine Verbesserungen",
        "Verbesserte Verwaltungsfunktionen",
        "Papierkorb",
        "Verbesserungen bei der Archivierung",
        "Verbesserungen am Job-Prozessor",
        "Allgemeine Verbesserungen",
        "Als Administrator können Sie jetzt die Papierkorbfunktion aktivieren oder deaktivieren.",
        "Die Papierkorbfunktion in Vault Professional bietet eine sichere Methode zum Verwalten des Löschvorgangs bei Objekten wie Dateien und Ordnern.",
        "Diese Funktion ist vorgabemäßig aktiviert und ermöglicht es Benutzern, Objekte in den Papierkorb zu verschieben, anstatt sie dauerhaft zu löschen.",
        "Dies reduziert das Risiko eines versehentlichen Datenverlusts und verbessert die Benutzerfreundlichkeit, indem Benutzer mehr Kontrolle über die Dateiverwaltung erhalten."
      ],
      "images": [
        {
          "path": "images/img_01.png",
          "caption": "Vault"
        }
      ],
      "notes": "Source: https://help.autodesk.com/view/VAULT/2026/DEU/?guid=GUID-9F3302FA-488B-4021-ADDE-DF0AC877298600"
    },
    {
      "title": "Wer kann die Funktion aktivieren oder deaktivieren?",
      "bullets": [
        "Nur Administratoren können die Papierkorbfunktion aktivieren oder deaktivieren."
      ],
      "images": [],
      "notes": "Source: https://help.autodesk.com/view/VAULT/2026/DEU/?guid=GUID-9F3302FA-488B-4021-ADDE-DF0AC877298600"
    },
    {
      "title": "Wer kann Objekte löschen oder dauerhaft aus dem Papierkorb entfernen?",
      "bullets": [
        "Bedingte Dateilöschung",
        "Unbedingte Dateilöschung",
        "Administratoren haben die Berechtigung zum Löschen aller Objekte, unabhängig davon, wer sie erstellt hat.",
        "Benutzer, die ein Objekt erstellen, haben ebenfalls die Berechtigung, es zu löschen oder wiederherzustellen.",
        "Die gelöschten Objekte werden in den Papierkorb verschoben, wo sie jederzeit wiederhergestellt werden können.",
        "Allerdings können nur Administratoren Objekte dauerhaft aus dem Papierkorb löschen.",
        "Administratoren können Objekte ohne Einschränkungen löschen und Regeln für untergeordnete Objekte oder ausgecheckte Elemente außer Kraft setzen.",
        "Die folgenden Berechtigungen ermöglichen diesen das dauerhafte Löschen von Objekten:"
      ],
      "images": [],
      "notes": "Source: https://help.autodesk.com/view/VAULT/2026/DEU/?guid=GUID-9F3302FA-488B-4021-ADDE-DF0AC877298600"
    },
    {
      "title": "Wichtige Hinweise:",
      "bullets": [
        "Die Berechtigung Aus Papierkorb löschen wurde neu eingeführt.",
        "Benutzer mit Löschberechtigung, einschließlich bestimmter spezieller Benutzer, können Objekte aus dem Papierkorb wiederherstellen.",
        "Archivierungsaktionen beziehen sich in der Regel auf Objekte im Papierkorb.",
        "Die Bereinigungsaktion gilt nicht für Objekte im Papierkorb.",
        "Objekte werden einzeln verarbeitet, mit Ausnahme von Visualisierungsdateien ( DWF ), die zusammen mit den zugehörigen Konstruktionsdateien gelöscht und wiederhergestellt werden.",
        "Weitere Informationen über die Papierkorbfunktion finden Sie unter Papierkorb ."
      ],
      "images": [],
      "notes": "Source: https://help.autodesk.com/view/VAULT/2026/DEU/?guid=GUID-9F3302FA-488B-4021-ADDE-DF0AC877298600"
    }
  ]
}