[
  {
    "url": "https://help.autodesk.com/view/VAULT/2026/ENU/?guid=GUID-E7952218-BF45-4D4B-A497-781538FE792D00",
    "title": "What's New in Vault 2026",
    "text": "What's New in Vault 2026\nThis release of Vault delivers enhancements requested by you and the Vault user community, enabling you to accelerate overall design creation and data management experience significantly.\nLearn about new features in this release of Vault. For technical details, see the\nrelease notes.\n\n2026.1 Update Highlights\nWorkflow Enhancements\nExplore the new capabilities and enhancements introduced in this release, which enhance workflow efficiencies.\nConnectivity Enhancements\nConnect Vault to Fusion Manage Seamlessly and Efficiently with the new Vault Connector\nCollaboration Enhancements\nExplore the new capabilities and enhancements introduced in this release, which enhance collaboration.\n\n2026 Release Highlights\nAdministration Enhancements\nCheck out the new capabilities and enhancements available for administration in this release.\nTrash Bin\nAs an administrator, you can now enable or disable the 'Trash Bin' feature. The Trash Bin feature in Vault Professional provides a secure way to manage deletion of entities such as files and folders. This feature is enabled by default and allows users to move entities to the Trash Bin instead of permanently deleting them. It minimizes the risk of accidental data loss and enhances usability by giving users greater control over file management.\nJob Processor Enhancements\nYou can prioritize and control job executions to better manage failures when given the Job Queue Reserve role.\nArchive Enhancements\nAs an administrator, you can now enable file store archiving for a Vault and specify the archived file store path. A new 'Archive Status' property will be available for folders and files.\nPages in this section\n2026.1 Updates and Enhancements\n2026 Updates and Enhancements",
    "images": [
      "https://help.autodesk.com/view/VAULT/2026/ENU/images/product-title.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-1-copydesign-propertyedit.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-1-vault-connector.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-1-viewer-navigation.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-thinclient-update.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-enable-trashbin.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-job-enhancement.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2025-searchcriterial-16-9-edited.jpg"
    ]
  },
  {
    "url": "https://help.autodesk.com/view/VAULT/2026/ENU/?guid=WN-workflow-2026_1",
    "title": "Workflow Enhancements (What's New in 2026.1)",
    "text": "Workflow Enhancements (What's New in 2026.1)\nExplore the new capabilities and enhancements introduced in this release, which enhance workflow efficiencies.\nCopy Design - Property Editing\nUnlock a more intelligent and streamlined design workflow with the Vault 2026.1 Update. This enhanced Copy Design feature now empowers users to edit key properties during the copying process, thereby eliminating the risk of missed updates and conserving valuable time. Whether one is duplicating a drawing, a complete design structure, or individual components, it is now possible to modify multiple properties simultaneously, utilizing intuitive copy/paste functionality or directly from Excel. Initiate your next design with confidence, precision, and efficiency right from the moment of copying.\n\nCopy Design - Main View Grid\nFeature was inspired by suggestions from the Vault Community Idea Board.\n\nCopy Design – Numbering Scheme\nEliminate Renaming Headaches with Default Numbering Distribution\nVault 2026.1 streamlines the Copy Design process by enabling administrators to establish and disseminate a default numbering scheme for all users. This improvement guarantees consistency from the outset, thus averting expensive renaming tasks and diminishing errors that may arise from improper numbering or naming conventions. By standardizing the nomenclature of new designs, teams conserve time, remain aligned with corporate standards, and ensure that projects progress without disruption.\n\nCopy Design - Select Numbering Scheme\nUpdate Properties Enhancement\nVault 2026.1 eliminates the inconvenience associated with manual property updates through the introduction of a new, intelligent prompt during file check-out from the Vault client. When users initiate the check-out of a file within the Vault client, they are promptly reminded to update the mapped properties, thereby ensuring data synchronization without necessitating additional steps. This straightforward automation mitigates errors, conserves time, and maintains alignment between designs and Vault data. Though it represents a minor alteration, it possesses a substantial effect on overall productivity.\n\nBatch Plot Enhancement\nBatch Plot Smarter - From 40 Clicks to Just 3\nVault 2026.1 brings a revolutionary advancement to batch plotting through a markedly simplified workflow. Instead of navigating through a cumbersome process involving 40 manual clicks, users are now able to generate comprehensive drawing lists in merely three clicks by utilizing the new “Plot Related Design Representation Files” command. By selecting the top-level assembly, Vault systematically compiles all pertinent design representation files, which are then prepared for batch plotting. This enhancement not only saves time but also diminishes errors, thereby allowing your teams to concentrate on design rather than file preparation.\n\nAccess the Plot Manager\nLayout View Enhancement\nBigger Thumbnails, Faster Decisions\nVault 2026.1 enhances the viewing experience by introducing resizable thumbnails in the Vault grid, allowing for easier differentiation between similar models and drawings at a glance. Users are no longer required to open files individually to locate the correct one. This update substantially decreases the number of clicks necessary, streamlining workflow processes and increasing productivity. With improved visuals and reduced procedural steps, users will spend less time searching and more time focused on delivering results.\n\nPDF Automatic Item Attachment\nVault 2026.1 significantly enhances operational efficiency through the automation of attaching 2D PDF files during the Assign/Update Item process. The previous manual steps and the possibility of overlooked files have been eliminated; PDFs are now seamlessly integrated with Items, akin to DWG and IDW representations. This improvement guarantees the inclusion of essential documentation, thereby mitigating the risk of oversight and expediting transitions to downstream teams. Stakeholders can now allocate less time to file management and focus more on design efforts.\n\nAssign Items\nParent page:\n2026.1 Updates and Enhancements",
    "images": [
      "https://help.autodesk.com/view/VAULT/2026/ENU/images/product-title.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-1-copydesign-propertyedit.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-1-copydesign-numberscheme.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-1-update-properties.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-1-batchplot.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-1-thumbnail.png"
    ]
  },
  {
    "url": "https://help.autodesk.com/view/VAULT/2026/ENU/?guid=WN-connectivity-2026_1",
    "title": "Connectivity Enhancements (What's New in 2026.1)",
    "text": "Connectivity Enhancements (What's New in 2026.1)\nConnect Vault to Fusion Manage Seamlessly and Efficiently with the new Vault Connector\nVault Connector\nVault 2026.1 introduces the Vault Connector, a native, out-of-the-box (OOTB) connector that bridges the gap between design data management and process management systems. The Vault Connector is a powerful new integration that connects Autodesk Vault Professional (PDM) with Fusion Manage (PLM). This solution streamlines enterprise workflows by automating item and BOM synchronization, attaching neutral format files, and mapping attributes between systems. With built-in user notifications, configurable data flows, and support for multiple Vaults within a single Fusion Manage tenant, teams save hours of manual effort and avoid costly errors. From editing Items to creating BOMs, every step is faster, wiser, and fully connected.\nFor more information about the Vault Connector, see\nVault Connector\n. For frequently asked questions about the Vault Connector, see\nVault Connector FAQs\n.\nParent page:\n2026.1 Updates and Enhancements",
    "images": [
      "https://help.autodesk.com/view/VAULT/2026/ENU/images/product-title.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-1-vault-connector.png"
    ]
  },
  {
    "url": "https://help.autodesk.com/view/VAULT/2026/ENU/?guid=WN-collaboration-2026_1",
    "title": "Collaboration Enhancements (What's New in 2026.1)",
    "text": "Collaboration Enhancements (What's New in 2026.1)\nExplore the new capabilities and enhancements introduced in this release, which enhance collaboration.\nViewer Document Navigation\nNavigate Multi-Sheet Drawings 30% Faster in the Vault Viewer.\nVault 2026.1 introduces robust new navigation buttons in the integrated viewer for both thick and thin clients, designed to significantly expedite the review process. Users can now traverse multi-sheet drawings in the Autodesk Viewer with ease—eliminating the need for repetitive clicking or the search for the appropriate page. This intuitive enhancement enhances productivity by up to 30%, allowing teams to review documentation more expeditiously and make informed decisions with assurance. Regardless of whether one is involved in engineering, manufacturing, or quality control, improved navigation translates to accelerated progress.\nFor more information, see Autodesk Viewer Tools.\nThin Client Enhancements\nResize, Remember, and Review Faster in the Vault Thin Client\nVault 2026.1 presents a more innovative and efficient approach to managing file properties within the Thin Client environment. The introduction of a resizable property panel, accompanied by persistent panel settings, allows users to instantly view extended property values without the necessity to hover or scroll. This advancement not only conserves time but also mitigates frustration. Furthermore, enhanced caching substantially decreases load times when handling large assemblies, facilitating the revisitation of files without unnecessary waiting periods. The overall experience is quicker and more seamless, allowing users to concentrate on making decisions rather than encountering delays.\nFor more information, see Thin Client - The Interface.",
    "images": [
      "https://help.autodesk.com/view/VAULT/2026/ENU/images/product-title.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-1-viewer-navigation.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-1-thinclient-property.png"
    ]
  },
  {
    "url": "https://help.autodesk.com/view/VAULT/2026/ENU/?guid=GUID-AC8C6A07-2A29-4026-BC9E-ECE7AD635A3500",
    "title": "Administration Enhancements (What's New in 2026)",
    "text": "Administration Enhancements (What's New in 2026)\nCheck out the new capabilities and enhancements available for administration in this release.\nVault Account Enhancement – Security updates\nAs an administrator, you can now set a \"Disable On\" date for user accounts. The account will be automatically disabled on the specified date based on the server date.\nA Vault Ideas submission\nThin Client URL Property in email template\nYou can now add or remove the Thin Client URL property in the email template. For more information, see\nCustomize Email Notification Template\nServer Event Low Priority Mode for Property Compliance Check\nThe Low Priority Mode will be enabled during working hours by default. This mode now supports property compliance checks. Property compliance checks can be triggered by property definition changes during working hours.\nVault administrator contact details\nThe administrator can add their contact information in the newly introduced \"Contact your Vault Administrator\" field in vault server. The administrator contact information will be displayed to users, whose user account is disabled and when they try to login to server from Vault Client.\nFor more information, see\nSecurity Global Settings\n.\nParent page:\n2026 Updates and Enhancements",
    "images": [
      "https://help.autodesk.com/view/VAULT/2026/ENU/images/product-title.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-thinclient-update.png"
    ]
  },
  {
    "url": "https://help.autodesk.com/view/VAULT/2026/ENU/?guid=GUID-9F3302FA-488B-4021-ADDE-DF0AC877298600",
    "title": "Trash Bin (New in 2026)",
    "text": "Trash Bin (New in 2026)\nAs an administrator, you can now enable or disable the 'Trash Bin' feature. The Trash Bin feature in Vault Professional provides a secure way to manage deletion of entities such as files and folders. This feature is enabled by default and allows users to move entities to the Trash Bin instead of permanently deleting them. It minimizes the risk of accidental data loss and enhances usability by giving users greater control over file management.\nWho can enable or disable the feature?\nOnly administrators can enable or disable the Trash Bin feature.\nNote:\nIf the Trash Bin feature is disabled, deleting files and folders will permanently remove them from Vault.\nWho can delete or permanently delete entities from the Trash Bin?\nThe administrators have the permission to delete any object, regardless of who created it. Users who create an entity also have permission to delete or restore it. The deleted entities are moved to the Trash Bin, where they can be restored at any time. However, only administrators can permanently delete entities from the Trash Bin. The administrators can delete entities without restrictions, overriding rules related to child entities or checked-out items. The following permissions allow them to permanently delete entities:\nFile Delete Conditional\nFile Delete Unconditional\nImportant points to note:\nA new \"Delete from Trash Bin\" permission has been introduced.\nUsers with delete access, including specific special users, can restore entities from the Trash Bin.\nArchiving actions generally apply to entities within the Trash Bin.\nThe purge action does not apply to entities in the Trash Bin.\nEntities are treated individually, except for visualization files (\nDWF\n), which are deleted and restored along with their associated design files.\nFor additional information about the Trash Bin feature, see\nTrash Bin.\nParent page:\n2026 Updates and Enhancements",
    "images": [
      "https://help.autodesk.com/view/VAULT/2026/ENU/images/product-title.png"
    ]
  },
  {
    "url": "https://help.autodesk.com/view/VAULT/2026/ENU/?guid=GUID-AC8C6A07-2A29-4026-BC9E-ECE7AD635A3502",
    "title": "Archive Enhancements (What's New in 2026)",
    "text": "Archive Enhancements (What's New in 2026)\nAs an administrator, you can now enable file store archiving for a Vault and specify the archived file store path. A new 'Archive Status' property will be available for folders and files.\nNote:\nThis new enhancement is available only in Autodesk Vault Professional.\nFor more information, see\nArchive.\nParent page:\n2026 Updates and Enhancements",
    "images": [
      "https://help.autodesk.com/view/VAULT/2026/ENU/images/product-title.png"
    ]
  },
  {
    "url": "https://help.autodesk.com/view/VAULT/2026/ENU/?guid=GUID-AC8C6A07-2A29-4026-BC9E-ECE7AD635A3501",
    "title": "Job Processor Enhancements (What's New in 2026)",
    "text": "Job Processor Enhancements (What's New in 2026)\nYou can prioritize and control job executions to better manage failures when given the Job Queue Reserve role.\nPush a job to top of the queue\nYou can now control job execution priorities and handle job failures efficiently. With the ability to promote critical jobs and enable automatic retries, users with Job Queue Reserve role can ensure smoother processing and minimize delays.\nSet to Top Priority\n: Right-click a specific job to access this option and promote it for immediate execution.\nFor more information, see\nJob Server Queue Overview.\nFeature was inspired by suggestions from the Vault Community Idea Board.\nParent page: 2026 Updates and Enhancements",
    "images": [
      "https://help.autodesk.com/view/VAULT/2026/ENU/images/product-title.png",
      "https://help.autodesk.com/cloudhelp/2026/ENU/Vault-New/images/new-2026-job-enhancement.png"
    ]
  },
  {
    "url": "https://help.autodesk.com/view/VAULT/2026/ENU/?guid=GUID-9F3302FA-488B-4021-ADDE-DF0AC877298601",
    "title": "General Enhancements",
    "text": "General Enhancements\nCheck out some of the general enhancements made to the Vault Client.\nSet the Focus Location for Move Operation\nYou can now specify the default focus location for move operation in Vault Client within the Vault Client Interface via\nTools\n>\nOptions\n.\nBy default, the Focus Location for Move Operation in Vault Client is on the Target Location. For more information, see\nSet the Focus Location for Move Operation.",
    "images": [
      "https://help.autodesk.com/view/VAULT/2026/ENU/images/product-title.png"
    ]
  }
]